#практична
"""Задано дві змінні a і b зі значеннями 5 та 10
відповідно. Напишіть функцію swap(a, b), яка обмінює
значеннями змінних a і b. Напишіть код, що демонструє
роботу функції та показує значення змінних a і b до та
після виклику функції."""
a=5
b=10
def swap(a,b):
    a,b=b,a
    return a,b
print(f'до обміну: a={a}, b={b}')
a,b=swap(a,b)
print(f'після обміну: a={a}, b={b}')




"""Напишіть функцію count_vowels(s), яка приймає
аргумент у вигляді рядка s та повертає кількість
голосних літер у цьому рядку. Напишіть код, що
демонструє роботу функції та показує кількість
голосних літер у деяких рядках.
"""
strings=['Hello', 'lol',"Olololol lolo lolo"]
s=input('шо перевірить')
def count_vowels(s):
    volwes='euioaAEYUIOA'
    count=0
    for leters in s:
        if leters in volwes:
            count+=1
    return count
#демонстрація
for s in strings:
    print(f"у рядку {s} голосних літер {count_vowels(s)}")



"""Напишіть функцію squares_list(lst), яка приймає
список lst чисел та повертає новий список зі
значеннями, які є квадратами елементів вхідного списку.
Напишіть код, що демонструє роботу функції та показує
список з квадратами елементів у деяких списках
"""


lst=[1,2,3,4,5]
def squares_list(lst):
    return[i**2 for i in lst]
print(squares_list(lst))


"""Задано словник зі словами та їх значеннями. Напишіть
функцію long_words(dictionary), яка приймає цей
словник та повертає список всіх слів, що містять не менше
ніж 5 символів (не забудьте оператор return). Напишіть
код, що демонструє роботу функції та показує список слів
у деяких словниках."""
dictionary={'gachi':1,'apple':2,'gun':3,'fruits':4,'rast':5,'bebra':6}

def long_words(dictionary):
    for word in dictionary:
        if len(word)==5:
            print(word)
long_words(dictionary)
